dex_of/hull_opt/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*  =========                 |
  \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \    /   O peration     | Website:  https://openfoam.org
    \  /    A nd           | Version:  12
     \/     M anipulation  |
*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

backgroundMesh
{
    xMin     -15.689;
    xMax     12.551;
    yMin     -12.878;
    yMax     0.0;
    zMin     -16.0;
    zMid1    -1.0;
    zMid2     0.188;
    zMid3     0.244;
    zMid4     0.3;
    zMid5     1.6;
    zMax      3.434;

    /*xCells   42;
    yCells   19;

    zCells1  10;
    zCells2  8;
    zCells3  32;
    zCells4  48;
    zCells5  40;
    zCells6  8;
    */

    xCells   40;
    yCells   12;

    zCells1  40;
    zCells2  40;
    zCells3  4;
    zCells4  4;
    zCells5  40 * (40/50);
    zCells6  40 * (20/50);
}

vertices
(
    (-15.689 -12.878 -8.585) // 0
    (12.551 -12.878 -8.585) // 1
    (12.551 0.0 -8.585) // 2
    (-15.689 0.0 -8.585) // 3

    (-15.689 -12.878 -1.0) // 4
    (12.551 -12.878 -1.0) // 5
    (12.551 0.0 -1.0) // 6
    (-15.689 0.0 -1.0) // 7

    (-15.689 -12.878 0.188) // 8
    (12.551 -12.878 0.188) // 9
    (12.551 0.0 0.188) // 10
    (-15.689 0.0 0.188) // 11

    (-15.689 -12.878 0.244) // 12
    (12.551 -12.878 0.244) // 13
    (12.551 0.0 0.244) // 14
    (-15.689 0.0 0.244) // 15

    (-15.689 -12.878 0.3) // 16
    (12.551 -12.878 0.3) // 17
    (12.551 0.0 0.3) // 18
    (-15.689 0.0 0.3) // 19

    (-15.689 -12.878 2.02) // 20
    (12.551 -12.878 2.02) // 21
    (12.551 0.0 2.02) // 22
    (-15.689 0.0 2.02) // 23

    (-15.689 -12.878 3.434) // 24
    (12.551 -12.878 3.434) // 25
    (12.551 0.0 3.434) // 26
    (-15.689 0.0 3.434) // 27

);

blocks
(
    // Block 1
    hex (0 1 2 3 4 5 6 7) 
    (
        40
        12
        40
    ) 
    simpleGrading (1 1 0.05)
    
    // Block 2
    hex (4 5 6 7 8 9 10 11) 
    (
        40
        12
        40
    ) 
    simpleGrading (1 1 1)
    
    // Block 3
    hex (8 9 10 11 12 13 14 15) 
    (
        40
        12
        3
    ) 
    simpleGrading (1 1 1)
    
    // Block 4
    hex (12 13 14 15 16 17 18 19) 
    (
        40
        12
        3
    ) 
    simpleGrading (1 1 1)
    
    // Block 6
    hex (16 17 18 19 20 21 22 23) 
    (
        40
        12
        32
    ) 
    simpleGrading (1 1 1)
    
    // Block 7
    hex (20 21 22 23 24 25 26 27) 
    (
        40
        12
        16
    ) 
    simpleGrading (1 1 5)
);

boundary
(
    atmosphere
    {
        type patch;
        faces
        (
            (24 25 26 27)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
            (5 6 10 9)
            (9 10 14 13)
            (13 14 18 17)
            (17 18 22 21)
            (21 22 26 25)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
            (4 8 11 7)
            (8 12 15 11)
            (12 16 19 15)
            (16 20 23 19)
            (20 24 27 23)
        );
    }
    bottom
    {
        type symmetryPlane;
        faces
        (
            (0 3 2 1)
        );
    }
    side
    {
        type symmetryPlane;
        faces
        (
            (0 1 5 4)
            (4 5 9 8)
            (8 9 13 12)
            (12 13 17 16)
            (16 17 21 20)
            (20 21 25 24)
        );
    }
     midPlane
     {
         type symmetryPlane;
         faces
         (
             (3 7 6 2)
             (7 11 10 6)
             (11 15 14 10)
             (15 19 18 14)
             (19 23 22 18)
             (23 27 26 22)
         );
     }
);


// ************************************************************************* //
